sysbench_log/r18340_wo_20231206_19:27:28_sbtest1Mx256_tableSize_1000000_tableCount_2_time_100_x2_threadCount_2_core_8_sbtest1Mx256_run.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 2 tps: 145.65 qps: 874.88 (r/w/o: 0.00/582.59/292.29) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 2 tps: 134.05 qps: 813.32 (r/w/o: 0.00/544.22/269.11) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 2 tps: 141.03 qps: 840.18 (r/w/o: 0.00/558.12/282.06) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 2 tps: 142.00 qps: 853.99 (r/w/o: 0.00/569.99/284.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 2 tps: 142.02 qps: 856.12 (r/w/o: 0.00/572.08/284.04) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 2 tps: 134.98 qps: 809.88 (r/w/o: 0.00/539.92/269.96) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 2 tps: 142.98 qps: 857.88 (r/w/o: 0.00/571.92/285.96) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 2 tps: 144.00 qps: 855.99 (r/w/o: 0.00/568.00/288.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 2 tps: 143.00 qps: 862.02 (r/w/o: 0.00/576.01/286.01) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 141.99 qps: 849.96 (r/w/o: 0.00/565.98/283.99) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 2 tps: 148.08 qps: 894.49 (r/w/o: 0.00/598.33/296.16) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 2 tps: 141.93 qps: 851.58 (r/w/o: 0.00/567.72/283.86) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 2 tps: 145.02 qps: 862.15 (r/w/o: 0.00/572.10/290.05) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 2 tps: 134.98 qps: 817.89 (r/w/o: 0.00/547.92/269.96) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 145.99 qps: 875.92 (r/w/o: 0.00/583.94/291.97) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 2 tps: 145.04 qps: 864.21 (r/w/o: 0.00/574.14/290.07) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 2 tps: 136.97 qps: 820.81 (r/w/o: 0.00/546.88/273.94) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 2 tps: 138.00 qps: 835.03 (r/w/o: 0.00/559.02/276.01) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 2 tps: 146.00 qps: 876.02 (r/w/o: 0.00/584.02/292.01) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 141.00 qps: 846.02 (r/w/o: 0.00/564.01/282.01) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 2 tps: 145.98 qps: 867.89 (r/w/o: 0.00/575.93/291.96) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 2 tps: 142.02 qps: 860.09 (r/w/o: 0.00/576.06/284.03) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 2 tps: 147.00 qps: 882.03 (r/w/o: 0.00/588.02/294.01) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 2 tps: 144.99 qps: 869.93 (r/w/o: 0.00/579.95/289.98) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 149.06 qps: 894.37 (r/w/o: 0.00/596.25/298.12) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 2 tps: 132.95 qps: 797.71 (r/w/o: 0.00/531.81/265.90) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 2 tps: 143.07 qps: 855.41 (r/w/o: 0.00/569.27/286.14) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 2 tps: 139.93 qps: 842.55 (r/w/o: 0.00/562.70/279.85) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 2 tps: 152.00 qps: 912.03 (r/w/o: 0.00/608.02/304.01) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 145.97 qps: 867.85 (r/w/o: 0.00/575.90/291.95) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 2 tps: 146.03 qps: 884.17 (r/w/o: 0.00/592.11/292.06) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 2 tps: 136.01 qps: 816.04 (r/w/o: 0.00/544.03/272.01) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 2 tps: 139.99 qps: 839.97 (r/w/o: 0.00/559.98/279.99) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 2 tps: 144.99 qps: 867.94 (r/w/o: 0.00/577.96/289.98) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 146.00 qps: 878.01 (r/w/o: 0.00/586.00/292.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 2 tps: 142.01 qps: 847.05 (r/w/o: 0.00/564.04/283.02) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 2 tps: 147.06 qps: 885.38 (r/w/o: 0.00/590.26/295.13) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 2 tps: 147.95 qps: 889.73 (r/w/o: 0.00/593.82/295.91) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 2 tps: 142.98 qps: 857.85 (r/w/o: 0.00/571.90/285.95) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 145.03 qps: 870.18 (r/w/o: 0.00/580.12/290.06) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 2 tps: 146.98 qps: 881.86 (r/w/o: 0.00/587.91/293.95) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 2 tps: 144.96 qps: 865.77 (r/w/o: 0.00/575.85/289.92) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 2 tps: 147.12 qps: 884.71 (r/w/o: 0.00/590.47/294.24) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 2 tps: 148.92 qps: 887.49 (r/w/o: 0.00/589.66/297.83) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 148.99 qps: 901.94 (r/w/o: 0.00/603.96/297.98) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 2 tps: 143.99 qps: 853.95 (r/w/o: 0.00/567.97/285.98) lat (ms,95%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 2 tps: 143.07 qps: 860.41 (r/w/o: 0.00/572.27/288.14) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 2 tps: 145.95 qps: 875.72 (r/w/o: 0.00/583.81/291.91) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 2 tps: 143.06 qps: 866.38 (r/w/o: 0.00/580.25/286.12) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 140.94 qps: 845.65 (r/w/o: 0.00/563.77/281.88) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 2 tps: 145.99 qps: 871.95 (r/w/o: 0.00/579.97/291.98) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 2 tps: 146.02 qps: 872.11 (r/w/o: 0.00/580.07/292.04) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 2 tps: 150.99 qps: 913.92 (r/w/o: 0.00/611.94/301.97) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 2 tps: 144.08 qps: 864.48 (r/w/o: 0.00/576.32/288.16) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 148.90 qps: 893.39 (r/w/o: 0.00/595.59/297.80) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 2 tps: 146.02 qps: 876.09 (r/w/o: 0.00/584.06/292.03) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 2 tps: 141.97 qps: 851.84 (r/w/o: 0.00/567.89/283.95) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 2 tps: 125.03 qps: 748.18 (r/w/o: 0.00/498.12/250.06) lat (ms,95%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 2 tps: 155.08 qps: 930.47 (r/w/o: 0.00/620.31/310.16) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 144.89 qps: 871.36 (r/w/o: 0.00/581.57/289.79) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 2 tps: 145.02 qps: 867.12 (r/w/o: 0.00/577.08/290.04) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 2 tps: 139.01 qps: 829.03 (r/w/o: 0.00/551.02/278.01) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 2 tps: 147.02 qps: 890.11 (r/w/o: 0.00/596.07/294.04) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 2 tps: 151.07 qps: 906.43 (r/w/o: 0.00/604.28/302.14) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 2 tps: 145.99 qps: 867.93 (r/w/o: 0.00/575.95/291.98) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 2 tps: 139.93 qps: 847.60 (r/w/o: 0.00/567.73/279.87) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 2 tps: 146.99 qps: 877.96 (r/w/o: 0.00/583.97/293.99) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 2 tps: 146.99 qps: 877.92 (r/w/o: 0.00/583.95/293.97) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 2 tps: 146.10 qps: 884.58 (r/w/o: 0.00/592.39/292.19) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 2 tps: 141.95 qps: 851.72 (r/w/o: 0.00/567.81/283.91) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 2 tps: 147.97 qps: 879.79 (r/w/o: 0.00/583.86/295.93) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 2 tps: 141.02 qps: 846.13 (r/w/o: 0.00/564.09/282.04) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 2 tps: 146.01 qps: 880.05 (r/w/o: 0.00/588.03/292.02) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 2 tps: 143.01 qps: 852.04 (r/w/o: 0.00/568.03/284.01) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 2 tps: 144.97 qps: 879.79 (r/w/o: 0.00/587.86/291.93) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 2 tps: 138.99 qps: 834.94 (r/w/o: 0.00/555.96/278.98) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 2 tps: 140.01 qps: 839.05 (r/w/o: 0.00/560.03/279.02) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 2 tps: 143.08 qps: 858.50 (r/w/o: 0.00/572.33/286.17) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 2 tps: 149.01 qps: 884.03 (r/w/o: 0.00/588.02/296.01) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 2 tps: 140.91 qps: 851.44 (r/w/o: 0.00/567.63/283.81) lat (ms,95%): 18.61 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 2 tps: 141.02 qps: 850.14 (r/w/o: 0.00/568.09/282.05) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 2 tps: 142.06 qps: 852.38 (r/w/o: 0.00/568.25/284.13) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 2 tps: 147.97 qps: 885.83 (r/w/o: 0.00/589.89/295.94) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 2 tps: 143.01 qps: 860.05 (r/w/o: 0.00/574.03/286.02) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 2 tps: 145.03 qps: 870.16 (r/w/o: 0.00/580.10/290.05) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 2 tps: 142.90 qps: 852.41 (r/w/o: 0.00/566.60/285.80) lat (ms,95%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 2 tps: 146.01 qps: 881.07 (r/w/o: 0.00/589.05/292.02) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 2 tps: 138.02 qps: 828.12 (r/w/o: 0.00/552.08/276.04) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 2 tps: 150.06 qps: 890.34 (r/w/o: 0.00/592.23/298.11) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 2 tps: 138.96 qps: 843.75 (r/w/o: 0.00/563.83/279.92) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 2 tps: 144.02 qps: 860.14 (r/w/o: 0.00/572.10/288.05) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 2 tps: 131.97 qps: 795.82 (r/w/o: 0.00/531.88/263.94) lat (ms,95%): 23.95 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 2 tps: 141.01 qps: 846.04 (r/w/o: 0.00/564.02/282.01) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 2 tps: 140.95 qps: 845.68 (r/w/o: 0.00/563.78/281.89) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 2 tps: 144.03 qps: 854.18 (r/w/o: 0.00/568.12/286.06) lat (ms,95%): 16.71 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 2 tps: 139.07 qps: 836.43 (r/w/o: 0.00/556.29/280.15) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 2 tps: 146.97 qps: 883.81 (r/w/o: 0.00/589.87/293.94) lat (ms,95%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 2 tps: 142.95 qps: 856.67 (r/w/o: 0.00/570.78/285.89) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 2 tps: 147.00 qps: 881.00 (r/w/o: 0.00/587.00/294.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 2 tps: 141.05 qps: 846.31 (r/w/o: 0.00/564.21/282.10) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           57440
        other:                           28720
        total:                           86160
    transactions:                        14360  (143.58 per sec.)
    queries:                             86160  (861.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0096s
    total number of events:              14360

Latency (ms):
         min:                                    9.59
         avg:                                   13.93
         max:                                   65.34
         95th percentile:                       17.32
         sum:                               199975.65

Threads fairness:
    events (avg/stddev):           7180.0000/13.00
    execution time (avg/stddev):   99.9878/0.00